# IsFaceSetOpen Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
TessellatedShapeBuilder..::..IsFaceSetOpen Property
TessellatedShapeBuilder Class See Also
---
Flag whether the current set of connected faces is open and additional tessellation faces can be added to it.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2015
# Syntax
C#
---
```text
public bool IsFaceSetOpen { get; }
```

Visual Basic
---
```text
Public ReadOnly Property IsFaceSetOpen As Boolean
	Get
```

Visual C++
---
```text
public:
property bool IsFaceSetOpen {
	bool get ();
}
```

# See Also
TessellatedShapeBuilder Class
Autodesk.Revit.DB Namespace